### Pandas Beispiele

In [30]:
import pandas as pd
import numpy as np

In [19]:
# Dataframe mit Spalten c1, c2 
df = pd.DataFrame()
df['c1'] = [10,20,20]
df['c2'] = [100,200,300]
df.index=['A','B','C']

In [20]:
df

   c1   c2
A  10  100
B  20  200
C  20  300

In [23]:
# Dataframe mit einer Liste von Zeilen
df = pd.DataFrame([[10,100],[20,200],[20,300]], index = ['A','B','C'], columns = ['c1', 'c2'])
df

   c1   c2
A  10  100
B  20  200
C  20  300

In [28]:
# Dataframe mit einem dictionary der Spalten
df = pd.DataFrame({'c1':[10,20,30], 'c2':[100,200,300]},index=['A','B','C'])
df

   c1   c2
A  10  100
B  20  200
C  30  300

#### Dataframes aus zweidimensionalen numpy-Arrays

In [31]:
df = pd.DataFrame(np.eye(5),dtype = 'int')
df

   0  1  2  3  4
0  1  0  0  0  0
1  0  1  0  0  0
2  0  0  1  0  0
3  0  0  0  1  0
4  0  0  0  0  1

In [33]:
df = pd.DataFrame(np.zeros((2,3),dtype = 'int'))
df

   0  1  2
0  0  0  0
1  0  0  0

In [34]:
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34